#Пример кода

books=[[]]*3
books[0].append("О духе законов")
books[1].append("Протестанская этика")
books[2].append("Об общественном договоре")
print(books)

#Нужно сделать список из 3х элементов. Можно ожидать, что после добавления значений в элементы с индексом 0,1,2, они появятся только в указанных ячейках. Но т.к. все три элемента books ссылаются на один и тот же список, значения отображаются во всех трех

#Исправление: создать три независимых списка

books=[[], [], []]
books[0].append("О духе законов")
books[1].append("Протестанская этика")
books[2].append("Об общественном договоре")
print(books)
