Для хранения информации о книге (book) используется tuple, поскольку книга содержит в себе неизмененяемый набор данных (номер, название, толщина книги и цвет)
Для того, чтобы хранить информацию о нескольких книгах я использовал list
Чтобы получить быстро информацию по какой-то книге, проще указать для каждой из книг соотвествующий идентификатор (1,2,3,4), поэтому использовался dict
set используется для того, чтобы вывести без повторений уникальные значения свойств книг (я в качестве примера выводил их цвет)
